/**
 * @fileOverview weibo robot
 * @authors http://weibo.com/u/5434811734
 */

'use strict';

exports.robot = {
    'client_id': 'app key',
    'client_secret': 'app secret',
    'username': 'username',
    'password': 'password',
    'mdDir': 'md',
    'repostText': ['转发', '转发微博', '扩散', '手动点赞', '[赞]', '[威武]', 'repost', '[呵呵]', '[赞啊]', 'nice!', 'get!'],
    'commentText': ['前排', '233', 'good', '看好你哦', '点赞', '手动点赞', '赞', '大赞', 'nice!', '[呵呵]', '[给力]', '[赞]', '[good]', '[噢耶]', '[赞啊]', '[威武]', '[萌翻]', '[xkl撒花]', '[xkl扭]', '[xkl转圈]', '[lt江南style]', '[c窃喜]', '[xb转圈]', '[抱抱]', '[耶]', '[嘻嘻]', '[bed弹跳]', '[ppb激动]', '[ppb鼓掌]'],
    'interval': 1.5,
    'tulingKey': 'tulingKey'
};


/**
 * user黑名单
 */
exports.blacklist = [
    '5175429989'
];

/**
 * user白名单
 */
exports.userWhiteList = [
    1167075935,
    1887410462,
    1734409185,
    5261893910,
    3244329632,
    2862431734,
    2717844351,
    2300420707,
    2025709963,
    1893751011,
    5322226545,
    2036070420,
    1996814695,
    5410753442,
    1712131295,
    2160639311,
    2158496600,
    1649383490,
    1649383490,
    1422502380,
    1644435615,
    1639621773,
    1820450311,
    1263362863,
    1750091491,
    1477178352,
    1196343093,
    2426203420,
    1407734557,
    1639517374,
    1397442732
];